# ----------------------------------------------------------------------------------------------------------문제
# 2차원 평면 위의 점 N개가 주어진다. 
# 좌표를 x좌표가 증가하는 순으로, x좌표가 같으면 y좌표가 증가하는 순서로 정렬한 다음 출력하는 프로그램을 작성하시오.

# ------------------------------------------------------------------------------------------------------예제 입력
# 첫째 줄에 점의 개수 N (1 ≤ N ≤ 100,000)이 주어진다. 
# 둘째 줄부터 N개의 줄에는 i번점의 위치 xi와 yi가 주어진다. 
# (-100,000 ≤ xi, yi ≤ 100,000) 좌표는 항상 정수이고, 위치가 같은 두 점은 없다.
"""
5
3 4
1 1
1 -1
2 2
3 3
"""
# ------------------------------------------------------------------------------------------------------예제 출력
# 첫째 줄부터 N개의 줄에 점을 정렬한 결과를 출력한다.
"""
1 -1
1 1
2 2
3 3
3 4
"""
# --------------------------------------------------------------------------------------------------알고리즘 분류
arr = [0, 1, 2, 4, 3]
queries = [[0, 4, 2],[0, 3, 2],[0, 2, 2]]


def solution(arr, queries):
    answer = []
    for s, e, k in queries:

        nl = [arr[i] for i in range(s, e+1) if arr[i] > k]

        if nl == []:
            answer.append(-1)
        elif nl != []:
            answer.append(min(nl))

    return answer


print(solution(arr, queries))

# ----------------------------------------------------------------------------------------------------------풀이

# arr = [0, 1, 1, 1, 0]

# # def top(arr):
# #     if arr != []:
# #         a = arr.pop()
# #         arr.append(a)
# #         return a


# def solution(arr):
#     i = 0
#     stk = []
#     while i < len(arr):
#         if stk == []:
#             stk.append(arr[i])
#             i += 1
#         else:
#             if stk[len(stk)-1] == arr[i]:
#                 stk.pop()
#                 i += 1
#             else:
#                 stk.append(arr[i])
#                 i += 1
        
#     return stk


# print(solution(arr))


# ------------------------------------------------------------------------------------------------------풀이 과정
# 